---
kind: method
id: M:Autodesk.Revit.DB.STLExportOptions.IsValidForMaxEdgeLength(System.Double)
source: html/58938961-b238-527d-0878-e1f4ced5077b.htm
---
# Autodesk.Revit.DB.STLExportOptions.IsValidForMaxEdgeLength Method

Checks whether the value is allowed (is in the allowed range) for MaxEdgeLength tessellation parameter.

## Syntax (C#)
```csharp
public static bool IsValidForMaxEdgeLength(
	double value
)
```

## Parameters
- **value** (`System.Double`) - The value to be checked.

## Returns
True if the value is valid for MaxEdgeLength, false otherwise.